#pragma once
#ifndef DAEDALUS_TURBO_CBOR_ZERO2_HPP
#define DAEDALUS_TURBO_CBOR_ZERO2_HPP
/* This file is part of Daedalus Turbo project: https://github.com/sierkov/daedalus-turbo/
 * Copyright (c) 2022-2023 Alex Sierkov (alex dot sierkov at gmail dot com)
 * Copyright (c) 2024-2025 R2 Rationality OÜ (info at r2rationality dot com)
 * This code is distributed under the license specified in:
 * https://github.com/sierkov/daedalus-turbo/blob/main/LICENSE */

/*
 * This is a zero-copy one-pass CBOR parser. It has a very small memory overhead and
 * ensures that nested data structures are accessed only once by default.
 * It was primarily developed for comparison of multi-gigabyte CBOR files in tight-on-RAM environments.
 * Furthermore, the low memory overhead, makes it well suited for parallel processing of CBOR data.
 *
 * The code is defined in a single header to benefit from maximum inlining for performance.
 */

#include <array>
#include <optional>
#include <variant>
#include <dt/common/bytes.hpp>
#include <dt/common/error.hpp>
#include <dt/common/format.hpp>
#include <dt/common/variant.hpp>
#include "dt/container.hpp"
#include "types.hpp"

namespace daedalus_turbo::cbor::zero2 {
    typedef daedalus_turbo::error error;

    struct incomplete_error: error {
        incomplete_error():
            error("cbor value data must contain at least one byte!")
        {
        }
    };

    using major_type = cbor::major_type;
    using special_val = cbor::special_val;

    struct decoder;
    struct value;

    struct reader {
    protected:
        friend value;
        // take self as a parameter to ensure the right (the subclass) "this" pointer is used
        // as a consequence, all methods calling _parent must be overridden virtual methods
        static const value &_parent(const void *self);

        static value &_parent(void *self)
        {
            return const_cast<value &>(_parent(static_cast<const void *>(self)));
        }

        // no need for a virtual destructor since no child class needs it

        virtual void consume() =0;

        value *next_chunk(value &);
    };

    struct simple_reader: reader {
        void consume() override;
    };

    struct special_reader: simple_reader {
        special_val read();
    };

    struct uint_reader: simple_reader {
        uint64_t read();
    };

    struct nint_reader: simple_reader {
        uint64_t read();
        uint64_t read_raw();
    };

    struct float32_reader: special_reader {
        float read();
    };

    struct text_reader: simple_reader {
        virtual void read(std::pmr::string &s);
        virtual void read(std::string &s);
        virtual std::string_view read();
    };

    struct chunked_text_reader: text_reader {
        chunked_text_reader(const chunked_text_reader &) =delete;

        chunked_text_reader(value &dec_level): _dec_level { dec_level }
        {
        }

        void read(std::pmr::string &s) override;
        void read(std::string &s) override;
        std::string_view read() override;
        void consume() override;
    private:
        value &_dec_level;
    };

    struct bytes_reader: simple_reader {
        virtual void read(std::pmr::vector<uint8_t> &b);
        virtual void read(write_vector &b);
        virtual buffer read();
    };

    struct chunked_bytes_reader: bytes_reader {
        chunked_bytes_reader(const chunked_text_reader &) =delete;

        chunked_bytes_reader(value &dec_level): _dec_level { dec_level }
        {
        }

        void read(std::pmr::vector<uint8_t> &b) override;
        void read(write_vector &b) override;
        buffer read() override;
        void consume() override;
    private:
        value &_dec_level;
    };

    // this reader is placed once the value has been consumed
    struct consumed_reader: reader {
        void consume() override
        {
        }
    };

    struct tag_reader: reader {
        tag_reader(const tag_reader &) =delete;

        tag_reader(value &dec_level);

        void consume() override;
        uint64_t id() const noexcept;
        value &read();
    private:
        const uint8_t *_begin_ptr;
        value &_val;
    };
    static_assert(sizeof(tag_reader) == 24);

    struct array_reader: reader {
        array_reader(const array_reader &) =delete;

        array_reader(value &dec_level) noexcept:
            _dec_level { dec_level }
        {
        }

        // a virtual destructor is not needed since values are stores as direct class instances
        virtual bool done();
        virtual value &read();
        array_reader &skip(const size_t num_items);
        void consume() override;
    protected:
        value &_dec_level;
    };
    static_assert(sizeof(array_reader) == 16);

    struct array_reader_sized: array_reader {
        using array_reader::array_reader;

        bool done() override;
        value &read() override;
        void consume() override;
    private:
        size_t _pos = 0;
    };
    static_assert(sizeof(array_reader_sized) == 24);

    struct map_reader: reader {
        map_reader(const map_reader &) =delete;

        map_reader(value &dec_level) noexcept:
            _dec_level { dec_level }
        {
        }

        // a virtual destructor is not needed since values are stored as direct class instances
        virtual bool done();
        virtual value &read_key();
        // the move argument is just a reminder that the previously returned key argument will be overwritten
        virtual value &read_val(value &&);
        void consume() override;
        void skip(const size_t num_items);
    protected:
        value &_dec_level;
    };
    static_assert(sizeof(map_reader) == 16);

    struct map_reader_sized: map_reader {
        using map_reader::map_reader;

        bool done() override;
        // must be overridden to ensure _parent gets the right version of "this" pointer
        value &read_key() override;
        value &read_val(value &&) override;
        void consume() override;
    private:
        size_t _pos = 0;
    };
    static_assert(sizeof(map_reader_sized) == 24);

    struct value {
        value(const value &o) =delete;

        value(const uint8_t *data_begin, decoder &parent);

        value &at(size_t pos);

        uint64_t uint()
        {
            return _reader_cast<uint_reader>().read();
        }

        uint64_t nint()
        {
            return _reader_cast<nint_reader>().read();
        }

        uint64_t nint_raw()
        {
            return _reader_cast<nint_reader>().read_raw();
        }

        buffer bytes()
        {
            return _reader_cast<bytes_reader>().read();
        }

        void to_bytes(std::pmr::vector<uint8_t> &res)
        {
            return _reader_cast<bytes_reader>().read(res);
        }

        void to_bytes(write_vector &res)
        {
            return _reader_cast<bytes_reader>().read(res);
        }

        std::string_view text()
        {
            return _reader_cast<text_reader>().read();
        }

